RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @subs = params[:post][:subs].map(&:to_i)
    if @post.save
      @subs.each do |sub_id|
        post_sub = PostSub.create(post_id: @post.id, sub_id: sub_id)
---
INSERT INTO "posts" ("title", "url", "content", "author_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "funny post"], ["url", "https://realk.com"], ["content", "jklajfs"], ["author_id", 3]]
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 2], ["sub_id", 2], ["created_at", "2022-04-09 00:10:49.417902"], ["updated_at", "2022-04-09 00:10:49.417902"]]

  def edit
    @post = Post.find_by(id: params[:id])
    @subs = @post.subs.map(&:id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]

  def update
    @post = Post.find_by(id: params[:id])
    @subs = params[:post][:subs].map(&:to_i)
    if @post && @post.author_id == current_user.id
      if @post.update(post_params)
        @post.post_subs.each do |ps|
          unless @subs.include?(ps.id)
            ps.destroy
          end
        end
        current_subs = @post.post_subs.map(&:sub_id)
        @subs.each do |sub_id|
          unless current_subs.include?(sub_id)
            PostSub.create(post_id: @post.id, sub_id: sub_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2 WHERE "posts"."id" = $3  [["url", "https://lewafeawetcode.com"], ["content", "asdgasfdasdfasgdasdfasdasgdafds"], ["id", 7]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."post_id" = $1 AND "post_subs"."sub_id" = $2 LIMIT $3  [["post_id", 1], ["sub_id", 2], ["LIMIT", 1]]
DELETE FROM "post_subs" WHERE "post_subs"."id" = $1  [["id", 2]]
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["sub_id", 2], ["created_at", "2022-04-08 22:43:27.129960"], ["updated_at", "2022-04-08 22:43:27.129960"]]

  def destroy
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]