RedditClone/app/controllers/subs_controller.rb

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find_by(id: params[:id])

INSERT INTO "subs" ("title", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @sub = Sub.new(sub_params)
    @sub.creator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Join the coders club, an exclusive club for lame coders."], ["updated_at", "2022-04-08 19:10:52.294196"], ["id", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = Sub.find_by(id: params[:id])