RedditClone/app/views/posts/_form.html.erb

        <div class="subs">
            <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"